# ContourSettingItem Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContourSettingItem Members
ContourSettingItem Class Methods Properties See Also
---
The ContourSettingItem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ContourSettingItem |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Start | The contour range start elevation. |
| Step | The increment elevation of the contour range. |
| Stop | The contour range stop elevation. |
| SubCategoryId | The contour line style subcategory id. |

# See Also
ContourSettingItem Class
Autodesk.Revit.DB Namespace